app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("name", "title", "content", "created_at", "updated_at") VALUES(E'a', E'b', E'c', '2010-03-26 08:05:14.779563', '2010-03-26 08:05:14.779563') RETURNING "id"